app/views/cart/show.html.erb


            <%@cart.join_table_cart_items.each do |item| %>
---
SELECT "items".* FROM "items" INNER JOIN "join_table_cart_items" ON "items"."id" = "join_table_cart_items"."item_id" WHERE "join_table_cart_items"."cart_id" = $1  [["cart_id", 16]]
SELECT "join_table_cart_items".* FROM "join_table_cart_items" WHERE "join_table_cart_items"."cart_id" = $1  [["cart_id", 16]]