app/controllers/user_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
def show
@user = User.find(current_user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
def edit
 @user = User.find(current_user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "users" SET "first_name" = $1, "last_name" = $2, "adress" = $3, "zipcode" = $4, "updated_at" = $5 WHERE "users"."id" = $6  [["first_name", "walter"], ["last_name", "white"], ["adress", "fgdfgetgetget"], ["zipcode", "13390"], ["updated_at", "2022-03-16 20:10:07.927237"], ["id", 11]]
---
def update
    @user = User.find(current_user.id)


    if @user.update(user_params)